Revit 2027 API
DisplacementElement.IsValidAsParentInView Method
 Indicates whether the specified DisplacementElement can be used as a parent when creating a DisplacementElement in the specified view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidAsParentInView(
	View view,
	DisplacementElement parent
)
Public Shared Function IsValidAsParentInView (
	view As View,
	parent As DisplacementElement
) As Boolean
public:
static bool IsValidAsParentInView(
	View^ view,
	DisplacementElement^ parent
)
static member IsValidAsParentInView :
        view : View *
        parent : DisplacementElement -> bool
Parameters
view View
 A view.
parent DisplacementElement
 A DisplacementElement.
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
DisplacementElement Class
Autodesk.Revit.DB Namespace